from pathlib import Path

from decouple import config

BASE_DIR = Path(__file__).resolve().parent

BOT_TOKEN = config("BOT_TOKEN", cast=str)
DB_NAME = BASE_DIR / "data.db"


LEET_COMBOS = {
    "bl": "ы",
    "b1": "ы",
    "6l": "ы",
    "3b": "з",
    "i0": "ю",
    "yo": "ё",
    "ya": "я",
    "ye": "е",
    "yu": "ю",
    "ch": "ч",
    "sh": "ш",
    "ph": "ф",
    "i": "й",
}

TRANSLATION_TABLE = {
    "a": "а",
    "b": "в",
    "c": "с",
    "d": "д",
    "e": "е",
    "f": "ф",
    "g": "г",
    "h": "н",
    "i": "и",
    "j": "й",
    "k": "к",
    "l": "л",
    "m": "м",
    "n": "н",
    "o": "о",
    "p": "р",
    "r": "р",
    "s": "с",
    "t": "т",
    "u": "у",
    "v": "в",
    "w": "ш",
    "x": "х",
    "y": "у",
    "z": "з",
    "3": "з",
    "0": "о",
    "6": "б",
    "1": "i",
    "@": "а",
    "$": "s",
    "+": "т",
    "9": "д",
}

BASE_BAD_WORDS = {
    "хуй",
    "пизд",
    "ебат",
    "ебал",
    "блядь",
    "бля",
    "мудак",
    "сука",
    "говно",
    "гандон",
    "манда",
    "шлюха",
    "жопа",
    "уебок",
    "залупа",
    "долбоеб",
    "пидор",
    "хер",
    "даун",
    "лох",
}

WHITELIST = {
    "рубля",
    "корабля",
    "употреблять",
    "оскорблять",
    "влюблять",
    "страховать",
    "парикмахер",
    "хлебать",
    "мандарин",
    "психуй",
}